Documents/Return.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Return</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Commentary</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Lattitude</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Longitude</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Outlet</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Outlet</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceList</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.PriceList</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReturnDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SR</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.User</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Stock</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Stock</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Visit</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Visit</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Contractor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Contractors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>SKUs</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SKU</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SKU</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Feature</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SKUFeatures</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Qty</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Discount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Total</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Units</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.UnitsOfMeasure</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Parameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Parameter</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.OrderParameters</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Return/Forms/DocumentFоrm/Ext/Form/Module.bsl
#Region CommonProcedureAndFunctions

&AtServer
Procedure OnOpenServer()
	
	Items.Number.ReadOnly = Not Users.HaveAdditionalRight(Catalogs.AdditionalAccessRights.EditDocumentNumbers);

	If Not IsInRole("Admin") Then
		
		Items.Number.ReadOnly		= True;
		Items.Date.ReadOnly			= True;
		Items.Outlet.ReadOnly		= True;
		Items.SR.ReadOnly			= True;
		Items.Visit.ReadOnly		= True;
		Items.PriceList.ReadOnly	= True;
		Items.Stock.ReadOnly		= True;
		Items.Lattitude.ReadOnly	= True;
		Items.Longitude.ReadOnly	= True;
		Items.Commentary.ReadOnly	= True;
		Items.SKUs.ReadOnly			= True;
		Items.Contractor.ReadOnly	= True;
		
	EndIf;

EndProcedure

#EndRegion

#Region UserInterface

&AtClient
Procedure OnOpen(Cancel)
	
	OnOpenServer();
	
EndProcedure

&AtClient
Procedure GetAmount()
	
	Str			= Items.SKUs.CurrentData;
	Str.Total	= Str.Price * (Str.Discount/100+1);
	Str.Amount	= Str.Total * Str.Qty;
	
EndProcedure

&AtClient
Procedure SKUsSKUOnChange(Item)
	
	GetAmount();
	
EndProcedure

&AtClient
Procedure SKUsQtyOnChange(Item)
	
	GetAmount();
	
EndProcedure

&AtClient
Procedure SKUsPriceOnChange(Item)
	
	GetAmount();
	
EndProcedure

&AtClient
Procedure SKUsDiscountOnChange(Item)
	
	GetAmount();
	
EndProcedure

&AtClient
Procedure SKUsTotalOnChange(Item)

	GetAmount();
	
EndProcedure

#EndRegion
